## Production: cognito
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                          NAME                          |
|----------|--------------------------------------------------------|
| add      | `aws_cloudwatch_log_group.cognito_email_sender`        |
|          | `aws_cloudwatch_log_group.cognito_pre_sign_up`         |
| update   | `aws_lambda_function.cognito_email_sender`             |
| recreate | `aws_lambda_layer_version.cognito_email_sender_nodejs` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cognito_email_sender will be created
  + resource "aws_cloudwatch_log_group" "cognito_email_sender" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + name              = "/aws/lambda/Cognito_Email_Sender"
      + retention_in_days = 90
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.cognito_pre_sign_up will be created
  + resource "aws_cloudwatch_log_group" "cognito_pre_sign_up" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + name              = "/aws/lambda/Cognito_Pre_Sign_Up"
      + retention_in_days = 90
      + tags_all          = (known after apply)
    }

  # aws_lambda_function.cognito_email_sender will be updated in-place
  ~ resource "aws_lambda_function" "cognito_email_sender" {
        id                             = "Cognito_Email_Sender"
      ~ last_modified                  = "2023-06-19T15:27:49.690+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:957818836222:layer:cognito_email_sender_node_packages:4",
        ] -> (known after apply)
      ~ source_code_hash               = "kHBj/FHrEPmo2RxFtFGw2DUd2ChyutC7uPNfd9zgL/c=" -> "Au9QF/JOavDRQ5VevDLPhwxxPe8omiNw08gEHhHx55Q="
        tags                           = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.cognito_email_sender_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "cognito_email_sender_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:957818836222:layer:cognito_email_sender_node_packages:4" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-06-19T15:27:25.757+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:957818836222:layer:cognito_email_sender_node_packages:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:957818836222:layer:cognito_email_sender_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "c+eGdPnzn4i6o3ffu7Y/K0Lk69/eTjIvSvDkf5SOk54=" -> "u6J74Ho/5YDhMmlrfw36uOZdFOTSPzqf3qTAAlgx1yY=" # forces replacement
      ~ source_code_size            = 14374963 -> (known after apply)
      ~ version                     = "4" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.cognito_email_sender"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.cognito_pre_sign_up"]
WARN - plan.json - main - Missing Common Tags: ["aws_cognito_user_pool.forms"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
